# #成绩0-59不及格，60-70及格 70-80 良好 80以上是优秀    [90,100,81,84]判断下改组成绩是否全部都是优秀,
# #[1,60,30,90.100,20,70.59.69.71,80,84]
#  for i in[1,60,30,90,100,20,70,59,69,71,80,84]:
#     if(i < 60):
#         a = 1
#     elif(i >= 60 and i< 80):
#         a = 2
#     else:
#         a = 3
#     if (a == 1):
#         print(i,'不及格')
#     if (a == 2):
#         print(i,'及格')
#     if (a == 3):
#         print(i,'优秀')
#
# a = 0
# for i in [90,100,81,84]:
#     if(i < 80):
#         a = 0
# if(a == 0):
#     print('不全优秀')
# else:
#     print ('全优秀')

#"01010010001110001001001010101010010101" 计算下几个0 几个1
# b = 0
# c = 0
# a = "01010010001110001001001010101010010101"
# for i in a:
#     if(i == '0'):
#         b=b+1
#     else:
#         c=c+1
# print('有',b,'个0',c,'个1')
#求1+2+3+4...+100

# i = 1
# a = 0
# while(i<=100):
#     a=i+a
#     i=i+1
# print(a)
# b = 1
# for i in range (1,10):
#     i=i+1
#     b=b*i
# print(b)
a='hxjwskcyyboboyuanbao'
print(a[0:6])
print(a[-7:])
print(a[9:13])

